## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 264 to add, 133 to change, 7 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuread_service_principal.sp
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-CONTROL&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].time_rotating.one_year
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].random_uuid.app_uuid
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].time_rotating.one_year
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_application_password.token
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].random_uuid.app_uuid
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-NonProd&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Prod&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Sandbox&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-PROD-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-SBOX-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_application.app
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-MANAGEMENT-TEST&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-DEV&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-SBOX-INTSVC&#34;].azurerm_subscription.this
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_application.app
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-TEST&#34;].azurerm_subscription.this
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_application.app
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuread_service_principal.sp
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Reform-CFT-Mgmt&#34;].azurerm_subscription.this
* Replace
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-MANAGEMENT-NONPROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;HMCTS-CONTROL&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-NONPROD-INTSVC&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;HMCTS-HUB-PROD-INTSVC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["Platform-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
        name                       = "Platform-NonProd"
      ~ subscription_ids           = [
          + "b44eb479-9ae2-42e7-9c63-f3c599719b6f",
          + "b50cfb90-d6cd-4e78-97e6-cb7958335b6e",
          + "ba3c6fcf-22b1-4a11-9080-1cf965c060e9",
          + "d7b54c7f-c2c9-41ee-930d-7056ebbb5bde",
          + "fb084706-583f-4c9a-bdab-949aac66ba5c",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Prod"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
        name                       = "Platform-Prod"
      ~ subscription_ids           = [
          + "04d27a32-7a07-48b3-95b8-3c8691e1a263",
          + "0978315c-75fe-4ada-9d11-1eb5e0e0b214",
          + "2b1afc19-5ca9-4796-a56f-574a58670244",
          + "ed302caf-ec27-4c64-a05e-85731c3ce90e",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
        name                       = "Platform-Sandbox"
      ~ subscription_ids           = [
          + "5709598c-3a1c-4535-8979-f10948b9a031",
          + "681c247c-c695-4b87-b018-8756a0b8b19d",
          + "b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac",
          + "ea3a8c1e-af9d-4108-bc86-a7e2d267f49c",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "6dea1d64-36a5-487c-92a9-44248c555bfc"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "70074b33-725e-4622-81f3-85a61299adb2"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-management-nonprod-intsvc) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dts-management-nonprod-intsvc)" -> null
              - enabled                    = true -> null
              - id                         = "70074b33-725e-4622-81f3-85a61299adb2" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-management-nonprod-intsvc) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dts-management-nonprod-intsvc)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dts-management-nonprod-intsvc) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dts-management-nonprod-intsvc)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dts-management-nonprod-intsvc) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dts-management-nonprod-intsvc)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "6dea1d64-36a5-487c-92a9-44248c555bfc"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
      + display_name                   = "DTS AKS Administrators (sub:dts-management-nonprod-intsvc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
      + display_name                   = "DTS AKS Users (sub:dts-management-nonprod-intsvc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-MANAGEMENT-NONPROD-INTSVC Subscription Contributors" -> "Grants contributor permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
        id                         = "04cbcc5c-53f7-4d15-a149-e4aa532962fb"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Key Vault Administrator"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-MANAGEMENT-NONPROD-INTSVC Subscription Key Vault Administrators" -> "Grants key vault administrator permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
        id                         = "a51d9791-f022-48f6-a11f-b4a5e5a73231"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-MANAGEMENT-NONPROD-INTSVC Subscription Owners" -> "Grants owner permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
        id                         = "dcaafb65-9230-4f57-9b63-dda9cc459df2"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-MANAGEMENT-NONPROD-INTSVC Subscription Readers" -> "Grants reader permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
        id                         = "707883b0-3f2b-481c-aac5-3ca9c4580bb2"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
      + display_name                   = "DTS Security Readers (sub:dts-management-nonprod-intsvc)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DTS-MANAGEMENT-NONPROD-INTSVC Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DTS-MANAGEMENT-NONPROD-INTSVC subscription"
        id                         = "b732c974-8c60-408e-b944-e588c972a149"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "04cbcc5c-53f7-4d15-a149-e4aa532962fb"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group_member.members["Key Vault Administrator-0"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "a51d9791-f022-48f6-a11f-b4a5e5a73231/member/29e4829a-6912-4285-8573-0afd9c5b70d8" -> (known after apply)
      ~ member_object_id = "29e4829a-6912-4285-8573-0afd9c5b70d8" -> "63469462-b784-42e8-8a66-20a8840ac84a" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuread_group_member.members["Key Vault Administrator-1"] must be replaced
-/+ resource "azuread_group_member" "members" {
      ~ id               = "a51d9791-f022-48f6-a11f-b4a5e5a73231/member/63469462-b784-42e8-8a66-20a8840ac84a" -> (known after apply)
      ~ member_object_id = "63469462-b784-42e8-8a66-20a8840ac84a" -> "29e4829a-6912-4285-8573-0afd9c5b70d8" # forces replacement
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "281b5edf-4b0c-4e1d-aa99-bdb08461e9c7"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "4b326c1b-5e67-43b4-8ded-6f7ccf6d5da4"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/cb44eb479f3c599719b6fkv"
        name                            = "cb44eb479f3c599719b6fkv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/cb44eb479f3c599719b6fkv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-stg-rg/providers/Microsoft.KeyVault/vaults/cb44eb479f3c599719b6fkv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://cb44eb479f3c599719b6fkv.vault.azure.net/secrets/sp-token/5b55adb1526e41d69785299170fe9a21"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DTS-MANAGEMENT-NONPROD-INTSVC"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ion                    = "Grants aks cluster admin permissions to the Reform-CFT-Mgmt subscription"
      + display_name                   = "DTS AKS Administrators (sub:reform-cft-mgmt)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the Reform-CFT-Mgmt subscription"
      + display_name                   = "DTS AKS Users (sub:reform-cft-mgmt)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-MGMT Subscription Contributors" -> "Grants contributor permissions to the Reform-CFT-Mgmt subscription"
        id                         = "13d33eb1-60a7-4d50-878b-0625081bcf66"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the Reform-CFT-Mgmt subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:reform-cft-mgmt)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-MGMT Subscription Owners" -> "Grants owner permissions to the Reform-CFT-Mgmt subscription"
        id                         = "fbf0fe12-b918-4ffc-95df-4b880cd4380c"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-MGMT Subscription Readers" -> "Grants reader permissions to the Reform-CFT-Mgmt subscription"
        id                         = "0a3a9204-8f79-403f-9917-5a19bc3ea045"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the Reform-CFT-Mgmt subscription"
      + display_name                   = "DTS Security Readers (sub:reform-cft-mgmt)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-MGMT Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the Reform-CFT-Mgmt subscription"
        id                         = "97445404-ee3a-4c98-8afb-b517e44797e1"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group_member.members["Contributor-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "13d33eb1-60a7-4d50-878b-0625081bcf66"
      + id               = (known after apply)
      + member_object_id = "f82c9799-9729-4620-aeec-1fd8fe7531ba"
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "13d33eb1-60a7-4d50-878b-0625081bcf66"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "f82c9799-9729-4620-aeec-1fd8fe7531ba"
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "fbf0fe12-b918-4ffc-95df-4b880cd4380c"
      + id               = (known after apply)
      + member_object_id = "f82c9799-9729-4620-aeec-1fd8fe7531ba"
    }

  # module.subscription["Reform-CFT-Mgmt"].azuread_service_principal.sp will be updated in-place
  ~ resource "azuread_service_principal" "sp" {
        id                           = "f82c9799-9729-4620-aeec-1fd8fe7531ba"
      ~ owners                       = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                         = []
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "14ad5165-aef3-4d83-812e-c66d4b6cb8aa"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "2ac7787d-10a2-4d9d-b761-30eb414c7b33"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-mgmt-rg/providers/Microsoft.KeyVault/vaults/ced302caf85731c3ce90ekv"
        name                            = "ced302caf85731c3ce90ekv"
      ~ tags                            = {
          - "activityName"       = "DTS Core Infrastructure" -> null
          + "application"        = "core"
          - "automation"         = jsonencode({}) -> null
          + "builtFrom"          = "hmcts/azure-enterprise"
          + "businessArea"       = "Cross-Cutting"
          - "costCentre"         = "0" -> null
          ~ "criticality"        = "high" -> "High"
          - "dataClassification" = "internal" -> null
          ~ "environment"        = "mgmt" -> "production"
          - "managedBy"          = "DevOps <dcd-devops-support@hmcts.net>" -> null
          - "solutionOwner"      = "DevOps <dcd-devops-support@hmcts.net>" -> null
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-mgmt-rg/providers/Microsoft.KeyVault/vaults/ced302caf85731c3ce90ekv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-mgmt-rg/providers/Microsoft.KeyVault/vaults/ced302caf85731c3ce90ekv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
      + content_type            = ""
        id                      = "https://ced302caf85731c3ce90ekv.vault.azure.net/secrets/sp-token/0bcc5f60b0d34bd19f9abc13bd4764d3"
        name                    = "sp-token"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-mgmt-rg/providers/Microsoft.Storage/storageAccounts/ced302caf85731c3ce90esa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "ced302caf85731c3ce90esa"
      ~ tags                              = {
          - "activityName"       = "DTS Core Infrastructure" -> null
          + "application"        = "core"
          - "automation"         = jsonencode({}) -> null
          + "builtFrom"          = "hmcts/azure-enterprise"
          + "businessArea"       = "Cross-Cutting"
          - "costCentre"         = "0" -> null
          ~ "criticality"        = "high" -> "High"
          - "dataClassification" = "internal" -> null
          ~ "environment"        = "mgmt" -> "production"
          - "managedBy"          = "DevOps <dcd-devops-support@hmcts.net>" -> null
          - "solutionOwner"      = "DevOps <dcd-devops-support@hmcts.net>" -> null
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/Reform-CFT-Mgmt"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-Mgmt"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["Reform-CFT-Mgmt"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 264 to add, 133 to change, 7 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.subscription["DTS-MANAGEMENT-SBOX-INTSVC"].azuread_group.groups["Contributor"] has changed
  ~ resource "azuread_group" "groups" {
        id                         = "dd075388-ae93-4fee-8943-516e5241b6cc"
      ~ members                    = [
          + "b7a68ebf-8ace-4855-9ea6-1f08ef0af8f9",
            # (3 unchanged elements hidden)
        ]
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":46,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->